app/Controllers/Admin.php

SELECT *
FROM `daftarhadir`
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `daftarhadir`
---
    public function home(){
        $pager = \Config\Services::pager();
        $model = new \App\Models\DaftarHadirModel();

        $currentPage = $this->request->getVar('page_bootstrap') ? $this->request->getVar('page_bootstrap') : 1;


        $data = [
            'daftarhadir'   => $model->paginate(5, 'bootstrap'),
            'pager'         => $model->pager,
            'currentPage'   => $currentPage
        ];