app/Controllers/Koleksi.php

SELECT *
FROM `daftarbuku`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `daftarbuku`
---
    public function buku()
    {
           $pager = \Config\Services::pager();
           $model = new DaftarBukuModel();

           $currentPage = $this->request->getVar('page_boot') ? $this->request->getVar('page_boot') : 1;

           $keyword = $this->request->getVar('keyword');
           if($keyword){
               $buku = $this->daftarBukuModel->search($keyword);
           }else{
               $buku = $this->daftarBukuModel;
           }

           $data = [
            'daftarbuku'   => $this->daftarBukuModel->paginate(5, 'boot'),
            'pager'         => $this->daftarBukuModel->pager,
            'currentPage'   => $currentPage
        ];