app/Controllers/Pinjam.php

SELECT *
FROM `pinjambuku`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `pinjambuku`
---
    public function pinjam()
    {
           $pager = \Config\Services::pager();
           $model = new PinjamBukuModel();

           $currentPage = $this->request->getVar('page_boot') ? $this->request->getVar('page_boot') : 1;

           $keyword = $this->request->getVar('keyword');
           if($keyword){
               $buku = $this->pinjamBukuModel->search($keyword);
           }else{
               $buku = $this->pinjamBukuModel;
           }

           $data = [
               'pinjambuku'   => $this->pinjamBukuModel->paginate(5, 'boot'),
               'pager'         => $this->pinjamBukuModel->pager,
               'currentPage'   => $currentPage
           ];